{
  "contact": {
    "email": "contact@pritishvaidya.dev",
    "location": "India",
    "stackoverflow": "https://pritishvaidya.xyz/stackoverflow",
    "blog": "https://pritishvaidya.xyz/blog"
  },
  "skills": [
    {
      "title": "General",
      "type": "percent",
      "subskills": [
        {
          "name": "Web App Development",
          "percent": 100
        },
        {
          "name": "Hybrid App Development",
          "percent": 100
        },
        {
          "name": "Design",
          "percent": 30
        }
      ]
    },
    {
      "title": "Languages",
      "type": "percent",
      "subskills": [
        {
          "name": "Javascript",
          "percent": 100
        },
        {
          "name": "Typescript",
          "percent": 90
        },
        {
          "name": "HTML",
          "percent": 90
        },
        {
          "name": "CSS",
          "percent": 80
        }
      ]
    },
    {
      "title": "View",
      "type": "tag",
      "subskills": [
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Svelte"
        }
      ]
    },
    {
      "title": "Rendering Frameworks",
      "type": "tag",
      "subskills": [
        {
          "name": "Next.js"
        },
        {
          "name": "Gatsby"
        },
        {
          "name": "SvelteKit"
        }
      ]
    },
    {
      "title": "State Management",
      "type": "tag",
      "subskills": [
        {
          "name": "Redux"
        },
        {
          "name": "Zustand"
        }
      ]
    },
    {
      "title": "CSS",
      "type": "tag",
      "subskills": [
        {
          "name": "CSS Modules"
        },
        {
          "name": "Styled Compoents"
        },
        {
          "name": "Tailwind"
        }
      ]
    },
    {
      "title": "Unit Testing",
      "type": "tag",
      "subskills": [
        {
          "name": "Jest"
        },
        {
          "name": "Vitest"
        },
        {
          "name": "Storybook"
        }
      ]
    },
    {
      "title": "Data Fetching",
      "type": "tag",
      "subskills": [
        {
          "name": "GraphQL"
        },
        {
          "name": "Tanstack Query"
        }
      ]
    },
    {
      "title": "Integration Testing",
      "type": "tag",
      "subskills": [
        {
          "name": "Playwright"
        },
        {
          "name": "Selenium"
        }
      ]
    },
    {
      "title": "Language Tooling",
      "type": "tag",
      "subskills": [
        {
          "name": "Babel"
        },
        {
          "name": "TypeScript"
        },
        {
          "name": "ESLint"
        }
      ]
    },
    {
      "title": "Software",
      "type": "tag",
      "subskills": [
        {
          "name": "Sentry"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Apollo"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Docker"
        }
      ]
    },
    {
      "title": "Databases",
      "type": "tag",
      "subskills": [
        {
          "name": "Postgresql"
        },
        {
          "name": "Mongodb"
        },
        {
          "name": "Parse"
        },
        {
          "name": "Firebase"
        }
      ]
    }
  ],
  "summary": "With over 8 years of experience in various industries, I help manage teams and build scalable FrontEnd solutions for different companies, engaging in thorough discussions with stakeholders to align on project objectives and deliverables.",
  "otherQualifications": [
    {
      "name": "Web App Development",
      "description": "Proficient in building responsive and high-performance web applications using modern frameworks and technologies."
    },
    {
      "name": "Error Monitoring and Alerting",
      "description": "Expert in establishing effective error monitoring and alerting systems to enhance application reliability and performance."
    },
    {
      "name": "CI / CD",
      "description": "Experienced in implementing Continuous Integration and Continuous Deployment (CI/CD) pipelines to streamline development workflows and ensure rapid delivery."
    },
    {
      "name": "Team Leadership",
      "description": "Skilled in leading and mentoring teams, fostering collaboration, and driving project success through effective communication and strategic planning."
    }
  ],
  "education": [
    {
      "institution": "National Institute of Technology",
      "degree": "Computer Science",
      "start": "2012",
      "end": "2016"
    }
  ],
  "experience": [
    {
      "id": "lrazorpay",
      "role": "Lead FrontEnd Engineer",
      "company": "Razorpay",
      "description": "In this role, I spearheaded the development of scalable features across Razorpay's core Payments and Loyalty product offerings. My responsibilities included managing a talented team of developers, ensuring we consistently met project deadlines while upholding high-quality code standards. I collaborated closely with stakeholders to define our project roadmaps and OKRs, ensuring alignment with overarching business objectives.\n\nOne of my key achievements was developing the Offers Categorization feature in Razorpay Checkout. This robust categorization system significantly enhanced user experience and simplified navigation, leading to higher engagement rates. Additionally, I took full ownership of creating a dedicated Gift Cards Portal on the Razorpay Merchant Dashboard, effectively streamlining the issuance process for merchants and improving operational efficiency.\n\nI also played a pivotal role in the development of a closed-loop wallet for Shopify, which enhanced our Loyalty product’s functionality and integration with e-commerce platforms, ultimately driving increased customer retention. My efforts in performance optimization led to faster load times and a more responsive user interface, contributing to a better user experience and reduced churn.\n\nFurthermore, I defined and implemented a structured cadence for alert monitoring across various applications, establishing an operational excellence (OPEX) framework that proactively addressed errors and outages. Finally, I developed an innovative AI-driven test case generator, which enabled automated testing across Razorpay Frontend applications, greatly improving testing efficiency and reducing time-to-market for new features.",
      "start": "Apr 2022",
      "end": "PRESENT"
    },
    {
      "id": "srazorpay",
      "role": "Senior FrontEnd Engineer",
      "company": "Razorpay",
      "description": "In this role, I was instrumental in building a scalable Mobile App using React Native for Razorpay's Neobanking Product. Collaborating closely with cross-functional teams, I focused on delivering high-quality features that enhanced user engagement and satisfaction. My efforts in performance optimization and user experience were key to the app's success in a competitive market.\n\nI spearheaded OKR planning by providing high-level estimations and T-shirt sizing for all projects, including leading the first public release of the Apple Watch integration. This initiative, along with implementing client performance improvements, resulted in enhanced app reliability and user experience. I also successfully resolved critical bugs, including Google Play violations and navigation race conditions, ensuring compliance with platform policies and significantly improving app stability and user retention.\n\nTo enhance developer productivity, I restructured CI release notes for Monorepo and implemented error masking in Sentry, which reduced on-call workload and aided the team in accurate task estimation and spillover management. I established and optimized dashboards for performance monitoring and analytics event setups in collaboration with stakeholders, improving visibility into app performance and enabling data-driven decision-making.\n\nAdditionally, I delivered engaging tech talks on the Light theme for the Razorpay X mobile app, fostering knowledge sharing within the team and emphasizing the importance of consistent design across platforms.",
      "start": "Feb 2021",
      "end": "Apr 2022"
    },
    {
      "role": "Senior FrontEnd Engineer",
      "company": "Language In Motion LLC",
      "description": "In this role, I played a pivotal part in developing the frontend of our application using React Native Web, which allowed for a versatile user experience across different platforms. My focus on delivering high-quality code ensured a robust and maintainable product.\n\nI built a new portal that enabled a 'write once, render anywhere' capability, significantly streamlining development processes and enhancing user experience. This approach not only simplified the development workflow but also allowed us to maintain consistency across various platforms.\n\nAdditionally, I integrated key features such as payment processing and referral links, which greatly boosted user engagement and satisfaction. I also optimized application performance by reducing bundle size and refining webpack configurations, resulting in faster load times and smoother navigation for users.",
      "start": "Apr 2019",
      "end": "Feb 2021"
    },
    {
      "role": "FullStack Engineer",
      "company": "RentZend LLC",
      "description": "As a FullStack Engineer, I contributed to the development of new features for a mobile app using React Native while also enhancing the NodeJS backend. My collaborative efforts with cross-functional teams ensured the delivery of high-quality, user-centered features.\n\nI implemented essential features for property viewing, buying, and renting, which greatly enhanced user interaction and satisfaction. My work involved integrating Apollo GraphQL, which streamlined data queries and improved the performance of the existing application.\n\nAdditionally, I upgraded overall application performance through better coding practices and modern technologies, leading to a more efficient and maintainable codebase. My role required a strong understanding of both frontend and backend technologies, allowing me to bridge gaps between teams effectively.",
      "start": "05/2018",
      "end": "03/2019"
    },
    {
      "role": "FullStack Engineer",
      "company": "Mokko Labs LLC",
      "description": "In this role, I was responsible for developing both frontend and backend components for various projects, using Angular and NodeJS. My ability to manage multiple tasks and projects simultaneously ensured timely delivery and high-quality results.\n\nI designed and developed the admin portal for SafeStart, incorporating various features, webhooks, and integrations to enhance functionality. Additionally, I constructed foundational APIs for MedSpotting using NodeJS and Express, facilitating seamless communication between the frontend and backend.\n\nI also converted critical hospital management features to a mobile application in React Native, improving accessibility and user experience. My work on developing React Native applications for Tiffinity included adding features such as payment processing and tracking, which significantly enhanced user engagement.",
      "start": "March 2017",
      "end": "Apr 2018"
    },
    {
      "role": "Software Design Engineer",
      "company": "Newgen Softwares Inc",
      "description": "In my role as a Software Design Engineer, I focused on redesigning the user interface for the IBPS model using HTML and CSS. My work aimed to improve usability and enhance the overall user experience.\n\nI revamped the user interface to create a more intuitive and user-friendly experience, ensuring accessibility for all users. This involved not only aesthetic improvements but also functionality enhancements, making it easier for users to navigate and interact with the system.",
      "start": "Apr 2016",
      "end": "Feb 2017"
    }
  ],
  "projects": [
    {
      "title": "Razorpay Checkout Enhancements",
      "description": "Developed a robust categorization system for offers within the Razorpay Checkout to enhance user experience and simplify navigation.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Conducted user research to identify pain points in the existing checkout process.",
        "Designed and implemented the categorization system, resulting in higher engagement rates.",
        "Collaborated with UI/UX designers to ensure the new features aligned with the overall product design.",
        "Monitored performance metrics post-launch to evaluate the impact of the enhancements."
      ],
      "link": "https://razorpay.com/demopg3/",
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "Tailwind"
        },
        {
          "name": "Svelte"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "XMobile App",
      "description": "Led the development of a scalable mobile application using React Native, focusing on delivering high-quality user experiences and seamless integration with backend services.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Apr 2023",
      "details": [
        "Collaborated with cross-functional teams to define user requirements and translate them into technical specifications.",
        "Implemented performance optimizations, achieving faster load times and a smoother user interface, significantly enhancing user engagement.",
        "Integrated third-party APIs for payment processing, notifications, and analytics, ensuring a robust and feature-rich application.",
        "Conducted thorough testing and debugging to identify and resolve issues, leading to a successful launch with minimal post-release bugs.",
        "Maintained the application post-launch by implementing user feedback and adding new features, continuously improving user satisfaction."
      ],
      "link": "https://razorpay.com/x/mobile-app/",
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "GraphQL"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "Apple Watch Integration for RazorpayX",
      "description": "Developed an innovative Apple Watch app for RazorpayX to enable seamless payout approvals, enhancing convenience for business owners on-the-go.",
      "details": [
        "Conducted market research to understand user needs for financial task management via wearable technology.",
        "Designed a user-friendly onboarding experience, including pairing the watch with the mobile app using OTP verification.",
        "Implemented a streamlined login process leveraging mobile app sessions to ensure easy access without repetitive credentials.",
        "Developed payout approval functionality, allowing users to approve pending payouts directly from their Apple Watch.",
        "Collaborated with cross-functional teams to ensure robust integration with existing Razorpay services and compliance with security standards."
      ],
      "company": "Razorpay",
      "start": "August 2021",
      "end": "November 2021",
      "subskills":[
        {
          "name": "Swift 5"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "Gift Card Management Portal",
      "description": "Took end-to-end ownership of the project, from its early review cycle to its release, collaborating closely with the team to develop and execute the project plan.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Facilitated early design reviews with an external agency, effectively identifying feasibility and challenges of project features.",
        "Onboarded new team members, fostering a smooth integration into the project workflow.",
        "Collaborated with the External Dashboard team to ensure successful project release and actively unblocked team members to promote project progress.",
        "Drove conversations with cross-team analytics folks and set up analytics events for all flows.",
        "Scheduled and conducted demo calls with stakeholders, ensuring transparency and alignment throughout the project lifecycle."
      ],
      "link": "https://dashboard.razorpay.com",
      "subskills":[
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Svelte"
        },
        {
          "name": "GraphQL"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "White Labeled Wallet Customer Portal",
      "description": "Took end-to-end ownership of the project, overseeing its development from the early review cycle to its successful release, focusing solely on the frontend aspect.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Collaborated closely with Product Managers to ensure alignment with project objectives and gathered feedback through scheduled demo calls.",
        "Worked with DevOps to set up Continuous Integration/Continuous Deployment (CI/CD) on AWS infrastructure, ensuring smooth deployment processes.",
        "Successfully delivered changes without any bugs highlighted in User Acceptance Testing (UAT), showcasing attention to detail and quality assurance."
      ],
      "link": "https://axiseasypay.razorpay.com/wallets",
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Tailwind"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "Shopify App",
      "description": "Owned the project from its early review stages to its release, effectively managing all aspects of development.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Collaborated with Backend Engineers to implement a new proxy authentication flow using SHA-based authentication, enhancing security.",
        "Developed the application using Shopify’s Liquid Templating Engine, showcasing adaptability to new technology stacks.",
        "Successfully delivered changes without any bugs identified during User Acceptance Testing (UAT), reflecting thorough testing and attention to detail."
      ],
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "Shopify Liquid"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    }
  ],
  "social": [
    {
      "service": "github",
      "url": "https://pritishvaidya.xyz/github"
    },
    {
      "service": "stackoverflow",
      "url": "https://pritishvaidya.xyz/stackoverflow"
    },
    {
      "service": "youtube",
      "url": "https://pritishvaidya.xyz/youtube"
    },
    {
      "service": "linkedin",
      "url": "https://pritishvaidya.xyz/linkedin"
    },
    {
      "service": "twitter",
      "url": "https://pritishvaidya.xyz/twitter"
    },
    {
      "service": "angellist",
      "url": "https://pritishvaidya.xyz/angellist"
    }
  ],
  "role": "FrontEnd Developer",
  "fullname": "Pritish Vaidya"
}
