{
  "contact": {
    "email": "contact@pritishvaidya.dev",
    "location": "India",
    "stackoverflow": "https://pritishvaidya.xyz/stackoverflow",
    "blog": "https://pritishvaidya.xyz/blog"
  },
  "skills": [
    {
      "title": "General",
      "type": "percent",
      "subskills": [
        {
          "name": "Web App Development",
          "percent": 100
        },
        {
          "name": "Hybrid App Development",
          "percent": 100
        },
        {
          "name": "Design",
          "percent": 30
        }
      ]
    },
    {
      "title": "Languages",
      "type": "percent",
      "subskills": [
        {
          "name": "Javascript",
          "percent": 100
        },
        {
          "name": "Typescript",
          "percent": 90
        },
        {
          "name": "HTML",
          "percent": 90
        },
        {
          "name": "CSS",
          "percent": 80
        }
      ]
    },
    {
      "title": "View",
      "type": "tag",
      "subskills": [
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Svelte"
        }
      ]
    },
    {
      "title": "Rendering Frameworks",
      "type": "tag",
      "subskills": [
        {
          "name": "Next.js"
        },
        {
          "name": "Gatsby"
        },
        {
          "name": "SvelteKit"
        }
      ]
    },
    {
      "title": "State Management",
      "type": "tag",
      "subskills": [
        {
          "name": "Redux"
        },
        {
          "name": "Zustand"
        }
      ]
    },
    {
      "title": "CSS",
      "type": "tag",
      "subskills": [
        {
          "name": "CSS Modules"
        },
        {
          "name": "Styled Compoents"
        },
        {
          "name": "Tailwind"
        }
      ]
    },
    {
      "title": "Unit Testing",
      "type": "tag",
      "subskills": [
        {
          "name": "Jest"
        },
        {
          "name": "Vitest"
        },
        {
          "name": "Storybook"
        }
      ]
    },
    {
      "title": "Data Fetching",
      "type": "tag",
      "subskills": [
        {
          "name": "GraphQL"
        },
        {
          "name": "Tanstack Query"
        }
      ]
    },
    {
      "title": "Integration Testing",
      "type": "tag",
      "subskills": [
        {
          "name": "Playwright"
        },
        {
          "name": "Selenium"
        }
      ]
    },
    {
      "title": "Language Tooling",
      "type": "tag",
      "subskills": [
        {
          "name": "Babel"
        },
        {
          "name": "TypeScript"
        },
        {
          "name": "ESLint"
        }
      ]
    },
    {
      "title": "Software",
      "type": "tag",
      "subskills": [
        {
          "name": "Sentry"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Apollo"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Docker"
        }
      ]
    },
    {
      "title": "Databases",
      "type": "tag",
      "subskills": [
        {
          "name": "Postgresql"
        },
        {
          "name": "Mongodb"
        },
        {
          "name": "Parse"
        },
        {
          "name": "Firebase"
        }
      ]
    }
  ],
  "summary": "With over 8 years of experience in various industries, I help manage teams and build scalable FrontEnd solutions for different companies, engaging in thorough discussions with stakeholders to align on project objectives and deliverables.",
  "otherQualifications": [
    {
      "name": "Web App Development",
      "description": "Proficient in building responsive and high-performance web applications using modern frameworks and technologies."
    },
    {
      "name": "Error Monitoring and Alerting",
      "description": "Expert in establishing effective error monitoring and alerting systems to enhance application reliability and performance."
    },
    {
      "name": "CI / CD",
      "description": "Experienced in implementing Continuous Integration and Continuous Deployment (CI/CD) pipelines to streamline development workflows and ensure rapid delivery."
    },
    {
      "name": "Team Leadership",
      "description": "Skilled in leading and mentoring teams, fostering collaboration, and driving project success through effective communication and strategic planning."
    }
  ],
  "education": [
    {
      "institution": "National Institute of Technology",
      "degree": "Computer Science",
      "start": "2012",
      "end": "2016"
    }
  ],
  "experience": [
    {
      "id": "lrazorpay",
      "role": "Lead FrontEnd Engineer",
      "company": "Razorpay",
      "description": "Led the development of scalable features for Payments and Loyalty products, managing a team and ensuring high-quality code. Key achievements include developing the Offers Categorization feature in Razorpay Checkout, building a Gift Cards Portal, and enhancing Shopify wallet integration. Improved app performance, introduced proactive monitoring with an OPEX framework, and developed an AI-driven test case generator, reducing errors and time-to-market.",
      "start": "Apr 2022",
      "end": "Nov 2024"
    },
    {
      "id": "srazorpay",
      "role": "Senior FrontEnd Engineer",
      "company": "Razorpay",
      "description": "Built a scalable React Native app for Razorpay's Neobanking product, optimizing performance and user experience. Delivered Apple Watch integration, resolved critical bugs, and restructured CI workflows. Created dashboards for performance monitoring, improved error tracking, and delivered tech talks to promote team knowledge sharing.",
      "start": "Feb 2021",
      "end": "Apr 2022"
    },
    {
      "role": "Senior FrontEnd Engineer",
      "company": "Language In Motion LLC",
      "description": "Developed a versatile React Native Web application with 'write once, render anywhere' capability. Built a new portal, integrated payment and referral features, and optimized performance with webpack refinements, enhancing user engagement and load times.",
      "start": "Apr 2019",
      "end": "Feb 2021"
    },
    {
      "role": "FullStack Engineer",
      "company": "RentZend LLC",
      "description": "Enhanced a mobile app with new React Native features and improved the NodeJS backend. Key contributions included property management functionalities, Apollo GraphQL integration, and overall performance upgrades, ensuring seamless user interaction.",
      "start": "May 2018",
      "end": "Mar 2019"
    },
    {
      "role": "FullStack Engineer",
      "company": "Mokko Labs LLC",
      "description": "Developed Angular and NodeJS components for various projects, including the SafeStart admin portal and APIs for MedSpotting. Converted hospital management features to React Native and improved Tiffinity's user engagement with payment and tracking features.",
      "start": "Mar 2017",
      "end": "Apr 2018"
    },
    {
      "role": "Software Design Engineer",
      "company": "Newgen Softwares Inc",
      "description": "Redesigned the IBPS model UI using HTML and CSS to improve usability and accessibility, creating a more intuitive user experience.",
      "start": "Apr 2016",
      "end": "Feb 2017"
    }
  ],
  "projects": [
    {
      "title": "Razorpay Checkout Enhancements",
      "description": "Developed a robust categorization system for offers within the Razorpay Checkout to enhance user experience and simplify navigation.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Conducted user research to identify pain points in the existing checkout process.",
        "Designed and implemented the categorization system, resulting in higher engagement rates.",
        "Collaborated with UI/UX designers to ensure the new features aligned with the overall product design.",
        "Monitored performance metrics post-launch to evaluate the impact of the enhancements."
      ],
      "link": "https://razorpay.com/demopg3/",
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "Tailwind"
        },
        {
          "name": "Svelte"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "XMobile App",
      "description": "Led the development of a scalable mobile application using React Native, focusing on delivering high-quality user experiences and seamless integration with backend services.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Apr 2023",
      "details": [
        "Collaborated with cross-functional teams to define user requirements and translate them into technical specifications.",
        "Implemented performance optimizations, achieving faster load times and a smoother user interface, significantly enhancing user engagement.",
        "Integrated third-party APIs for payment processing, notifications, and analytics, ensuring a robust and feature-rich application.",
        "Conducted thorough testing and debugging to identify and resolve issues, leading to a successful launch with minimal post-release bugs.",
        "Maintained the application post-launch by implementing user feedback and adding new features, continuously improving user satisfaction."
      ],
      "link": "https://razorpay.com/x/mobile-app/",
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "GraphQL"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "Apple Watch Integration for RazorpayX",
      "description": "Developed an innovative Apple Watch app for RazorpayX to enable seamless payout approvals, enhancing convenience for business owners on-the-go.",
      "details": [
        "Conducted market research to understand user needs for financial task management via wearable technology.",
        "Designed a user-friendly onboarding experience, including pairing the watch with the mobile app using OTP verification.",
        "Implemented a streamlined login process leveraging mobile app sessions to ensure easy access without repetitive credentials.",
        "Developed payout approval functionality, allowing users to approve pending payouts directly from their Apple Watch.",
        "Collaborated with cross-functional teams to ensure robust integration with existing Razorpay services and compliance with security standards."
      ],
      "company": "Razorpay",
      "start": "August 2021",
      "end": "November 2021",
      "subskills":[
        {
          "name": "Swift 5"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "Gift Card Management Portal",
      "description": "Took end-to-end ownership of the project, from its early review cycle to its release, collaborating closely with the team to develop and execute the project plan.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Facilitated early design reviews with an external agency, effectively identifying feasibility and challenges of project features.",
        "Onboarded new team members, fostering a smooth integration into the project workflow.",
        "Collaborated with the External Dashboard team to ensure successful project release and actively unblocked team members to promote project progress.",
        "Drove conversations with cross-team analytics folks and set up analytics events for all flows.",
        "Scheduled and conducted demo calls with stakeholders, ensuring transparency and alignment throughout the project lifecycle."
      ],
      "link": "https://dashboard.razorpay.com",
      "subskills":[
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Svelte"
        },
        {
          "name": "GraphQL"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "White Labeled Wallet Customer Portal",
      "description": "Took end-to-end ownership of the project, overseeing its development from the early review cycle to its successful release, focusing solely on the frontend aspect.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Collaborated closely with Product Managers to ensure alignment with project objectives and gathered feedback through scheduled demo calls.",
        "Worked with DevOps to set up Continuous Integration/Continuous Deployment (CI/CD) on AWS infrastructure, ensuring smooth deployment processes.",
        "Successfully delivered changes without any bugs highlighted in User Acceptance Testing (UAT), showcasing attention to detail and quality assurance."
      ],
      "link": "https://axiseasypay.razorpay.com/wallets",
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "React"
        },
        {
          "name": "React Native"
        },
        {
          "name": "Tailwind"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    },
    {
      "title": "Shopify App",
      "description": "Owned the project from its early review stages to its release, effectively managing all aspects of development.",
      "company": "Razorpay",
      "start": "Apr 2022",
      "end": "Present",
      "details": [
        "Collaborated with Backend Engineers to implement a new proxy authentication flow using SHA-based authentication, enhancing security.",
        "Developed the application using Shopify’s Liquid Templating Engine, showcasing adaptability to new technology stacks.",
        "Successfully delivered changes without any bugs identified during User Acceptance Testing (UAT), reflecting thorough testing and attention to detail."
      ],
      "subskills":[
        {
          "name": "JavaScript"
        },
        {
          "name": "Shopify Liquid"
        },
        {
          "name": "Figma"
        },
        {
          "name": "Coralogix"
        },
        {
          "name": "Sentry"
        }
      ]
    }
  ],
  "social": [
    {
      "service": "github",
      "url": "https://pritishvaidya.xyz/github"
    },
    {
      "service": "stackoverflow",
      "url": "https://pritishvaidya.xyz/stackoverflow"
    },
    {
      "service": "youtube",
      "url": "https://pritishvaidya.xyz/youtube"
    },
    {
      "service": "linkedin",
      "url": "https://pritishvaidya.xyz/linkedin"
    },
    {
      "service": "twitter",
      "url": "https://pritishvaidya.xyz/twitter"
    },
    {
      "service": "angellist",
      "url": "https://pritishvaidya.xyz/angellist"
    }
  ],
  "role": "FrontEnd Developer",
  "fullname": "Pritish Vaidya"
}
